docs: replace mermaid diagrams
